# DivideSystem Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..DivideSystem Method
MEPSystem Class See Also
---
Divide the phyisical networks in the system and create a new system for each network.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ICollection<ElementId> DivideSystem(
	Document ADoc
)
```

Visual Basic
---
```text
Public Function DivideSystem ( _
	ADoc As Document _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ DivideSystem(
	Document^ ADoc
)
```

# ### Parameters
ADoc
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The id of new created systems.
# Remarks
This function only works for Hvac and Piping system.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The system is not dividable. |

# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace